# Indexing and selecting data

In [1]:
%matplotlib inline

import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
try:
    import seaborn
except ImportError:
    pass

In [2]:
# redefining the example objects

# series
population = pd.Series({'Germany': 81.3, 'Belgium': 11.3, 'France': 64.3, 
                        'United Kingdom': 64.9, 'Netherlands': 16.9})

# dataframe
data = {'country': ['Belgium', 'France', 'Germany', 'Netherlands', 'United Kingdom'],
        'population': [11.3, 64.3, 81.3, 16.9, 64.9],
        'area': [30510, 671308, 357050, 41526, 244820],
        'capital': ['Brussels', 'Paris', 'Berlin', 'Amsterdam', 'London']}
countries = pd.DataFrame(data)
countries

     area    capital         country  population
0   30510   Brussels         Belgium        11.3
1  671308      Paris          France        64.3
2  357050     Berlin         Germany        81.3
3   41526  Amsterdam     Netherlands        16.9
4  244820     London  United Kingdom        64.9

Setting the index to the country names:

In [3]:
countries = countries.set_index('country')
countries

                  area    capital  population
country
Belgium          30510   Brussels        11.3
France          671308      Paris        64.3
Germany         357050     Berlin        81.3
Netherlands      41526  Amsterdam        16.9
United Kingdom  244820     London        64.9

## Some notes on selecting data

One of pandas' basic features is the labeling of rows and columns, but this makes indexing also a bit more complex compared to numpy. We now have to distuinguish between:

- selection by label
- selection by position.

### `data[]` provides some convenience shortcuts

For a DataFrame, basic indexing selects the columns.

Selecting a single column:

In [4]:
countries['area']

country
Belgium            30510
France            671308
Germany           357050
Netherlands        41526
United Kingdom    244820
Name: area, dtype: int64

or multiple columns:

In [5]:
countries[['area', 'population']]

                  area  population
country
Belgium          30510        11.3
France          671308        64.3
Germany         357050        81.3
Netherlands      41526        16.9
United Kingdom  244820        64.9

But, slicing accesses the rows:

In [6]:
countries['France':'Netherlands']

               area    capital  population
country
France       671308      Paris        64.3
Germany      357050     Berlin        81.3
Netherlands   41526  Amsterdam        16.9

<div class="alert alert-danger">
    <b>NOTE</b>: Unlike slicing in numpy, the end label is **included**.
</div>

So as a summary, `[]` provides the following convenience shortcuts:

- Series: selecting a label: `s[label]`
- DataFrame: selecting a single or multiple columns: `df['col']` or `df[['col1', 'col2']]`
- DataFrame: slicing the rows: `df['row_label1':'row_label2']` or `df[mask]`

### Systematic indexing with `loc` and `iloc`

When using `[]` like above, you can only select from one axis at once (rows or columns, not both). For more advanced indexing, you have some extra attributes:
    
* `loc`: selection by label
* `iloc`: selection by position

These methods index the different dimensions of the frame:

* `df.loc[row_indexer, column_indexer]`
* `df.iloc[row_indexer, column_indexer]`

Selecting a single element:

In [7]:
countries.loc['Germany', 'area']

357050

But the row or column indexer can also be a list, slice, boolean array, ..

In [8]:
countries.loc['France':'Germany', ['area', 'population']]

           area  population
country
France   671308        64.3
Germany  357050        81.3

---
Selecting by position with `iloc` works similar as indexing numpy arrays:

In [9]:
countries.iloc[0:2,1:3]

          capital  population
country
Belgium  Brussels        11.3
France      Paris        64.3

The different indexing methods can also be used to assign data:

In [10]:
countries2 = countries.copy()
countries2.loc['Belgium':'Germany', 'population'] = 10

In [11]:
countries2

                  area    capital  population
country
Belgium          30510   Brussels        10.0
France          671308      Paris        10.0
Germany         357050     Berlin        10.0
Netherlands      41526  Amsterdam        16.9
United Kingdom  244820     London        64.9

## Boolean indexing (filtering)

Often, you want to select rows based on a certain condition. This can be done with 'boolean indexing' (like a where clause in SQL). 

The indexer (or boolean mask) should be 1-dimensional and the same length as the thing being indexed.

In [12]:
countries['area'] > 100000

country
Belgium           False
France             True
Germany            True
Netherlands       False
United Kingdom     True
Name: area, dtype: bool

In [13]:
countries[countries['area'] > 100000]

                  area capital  population
country
France          671308   Paris        64.3
Germany         357050  Berlin        81.3
United Kingdom  244820  London        64.9

---

<div class="alert alert-success">
    <b>EXERCISE</b>: Add a column `density` with the population density (note: population column is expressed in millions)
</div>

In [14]:
countries['density'] = countries['population']*1000000 / countries['area']
countries

                  area    capital  population     density
country
Belgium          30510   Brussels        11.3  370.370370
France          671308      Paris        64.3   95.783158
Germany         357050     Berlin        81.3  227.699202
Netherlands      41526  Amsterdam        16.9  406.973944
United Kingdom  244820     London        64.9  265.092721

<div class="alert alert-success">
    <b>EXERCISE</b>: Select the capital and the population column of those countries where the density is larger than 300
</div>

In [15]:
countries.loc[countries['density'] > 300, ['capital', 'population']]

               capital  population
country
Belgium       Brussels        11.3
Netherlands  Amsterdam        16.9

<div class="alert alert-success">
    <b>EXERCISE</b>: Add a column 'density_ratio' with the ratio of the density to the mean density
</div>

In [16]:
countries['density_ratio'] = countries['density'] / countries['density'].mean()
countries

                  area    capital  population     density  density_ratio
country
Belgium          30510   Brussels        11.3  370.370370       1.355755
France          671308      Paris        64.3   95.783158       0.350618
Germany         357050     Berlin        81.3  227.699202       0.833502
Netherlands      41526  Amsterdam        16.9  406.973944       1.489744
United Kingdom  244820     London        64.9  265.092721       0.970382

<div class="alert alert-success">
    <b>EXERCISE</b>: Change the capital of the UK to Cambridge
</div>

In [17]:
countries.loc['United Kingdom', 'capital'] = 'Cambridge'
countries

                  area    capital  population     density  density_ratio
country
Belgium          30510   Brussels        11.3  370.370370       1.355755
France          671308      Paris        64.3   95.783158       0.350618
Germany         357050     Berlin        81.3  227.699202       0.833502
Netherlands      41526  Amsterdam        16.9  406.973944       1.489744
United Kingdom  244820  Cambridge        64.9  265.092721       0.970382

<div class="alert alert-success">
    <b>EXERCISE</b>: Select all countries whose population density is between 100 and 300 people/km²
</div>

In [18]:
countries[(countries['density'] > 100) & (countries['density'] < 300)]

                  area    capital  population     density  density_ratio
country
Germany         357050     Berlin        81.3  227.699202       0.833502
United Kingdom  244820  Cambridge        64.9  265.092721       0.970382

## Some other useful methods: `isin` and string methods

The `isin` method of Series is very useful to select rows that may contain certain values:

In [19]:
s = countries['capital']

In [20]:
s.isin?

In [21]:
s.isin(['Berlin', 'London'])

country
Belgium           False
France            False
Germany            True
Netherlands       False
United Kingdom    False
Name: capital, dtype: bool

This can then be used to filter the dataframe with boolean indexing:

In [22]:
countries[countries['capital'].isin(['Berlin', 'London'])]

           area capital  population     density  density_ratio
country
Germany  357050  Berlin        81.3  227.699202       0.833502

Let's say we want to select all data for which the capital starts with a 'B'. In Python, when having a string, we could use the `startswith` method:

In [23]:
'Berlin'.startswith('B')

True

In pandas, these are available on a Series through the `str` namespace:

In [24]:
countries['capital'].str.startswith('B')

country
Belgium            True
France            False
Germany            True
Netherlands       False
United Kingdom    False
Name: capital, dtype: bool

For an overview of all string methods, see: http://pandas.pydata.org/pandas-docs/stable/api.html#string-handling

<div class="alert alert-success">
    <b>EXERCISE</b>: Select all countries that have capital names with more than 7 characters
</div>

In [25]:
countries[countries['capital'].str.len() > 7]

                  area    capital  population     density  density_ratio
country
Belgium          30510   Brussels        11.3  370.370370       1.355755
Netherlands      41526  Amsterdam        16.9  406.973944       1.489744
United Kingdom  244820  Cambridge        64.9  265.092721       0.970382

<div class="alert alert-success">
    <b>EXERCISE</b>: Select all countries that have capital names that contain the character sequence 'am'
</div>

In [26]:
countries[countries['capital'].str.contains('am')]

                  area    capital  population     density  density_ratio
country
Netherlands      41526  Amsterdam        16.9  406.973944       1.489744
United Kingdom  244820  Cambridge        64.9  265.092721       0.970382

## Pitfall: chained indexing (and the 'SettingWithCopyWarning')

In [27]:
countries.loc['Belgium', 'capital'] = 'Ghent'

In [28]:
countries

                  area    capital  population     density  density_ratio
country
Belgium          30510      Ghent        11.3  370.370370       1.355755
France          671308      Paris        64.3   95.783158       0.350618
Germany         357050     Berlin        81.3  227.699202       0.833502
Netherlands      41526  Amsterdam        16.9  406.973944       1.489744
United Kingdom  244820  Cambridge        64.9  265.092721       0.970382

In [29]:
countries['capital']['Belgium'] = 'Antwerp'

/home/joris/miniconda3/lib/python3.5/site-packages/ipykernel/__main__.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  if __name__ == '__main__':

In [30]:
countries

                  area    capital  population     density  density_ratio
country
Belgium          30510    Antwerp        11.3  370.370370       1.355755
France          671308      Paris        64.3   95.783158       0.350618
Germany         357050     Berlin        81.3  227.699202       0.833502
Netherlands      41526  Amsterdam        16.9  406.973944       1.489744
United Kingdom  244820  Cambridge        64.9  265.092721       0.970382

In [31]:
countries[countries['capital'] == 'Antwerp']['capital'] = 'Brussels'

/home/joris/miniconda3/lib/python3.5/site-packages/ipykernel/__main__.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  if __name__ == '__main__':

In [32]:
countries

                  area    capital  population     density  density_ratio
country
Belgium          30510    Antwerp        11.3  370.370370       1.355755
France          671308      Paris        64.3   95.783158       0.350618
Germany         357050     Berlin        81.3  227.699202       0.833502
Netherlands      41526  Amsterdam        16.9  406.973944       1.489744
United Kingdom  244820  Cambridge        64.9  265.092721       0.970382

How to avoid this?

* Use `loc` instead of chained indexing if possible!
* Or `copy` explicitly if you don't want to change the original data.

## More exercises!

For the quick ones among you, here are some more exercises with some larger dataframe with film data. These exercises are based on the [PyCon tutorial of Brandon Rhodes](https://github.com/brandon-rhodes/pycon-pandas-tutorial/) (so all credit to him!) and the datasets he prepared for that. You can download these data from here: [`titles.csv`](https://drive.google.com/open?id=0B3G70MlBnCgKajNMa1pfSzN6Q3M) and [`cast.csv`](https://drive.google.com/open?id=0B3G70MlBnCgKal9UYTJSR2ZhSW8) and put them in the `/data` folder.

In [31]:
cast = pd.read_csv('data/cast.csv')
cast.head()

                               title  year       name   type character   n
0                    Suuri illusioni  1985     Homo $  actor    Guests  22
1     Gangsta Rap: The Glockumentary  2007  Too $hort  actor   Himself NaN
2                  Menace II Society  1993  Too $hort  actor   Lew-Loc  27
3  Porndogs: The Adventures of Sadie  2009  Too $hort  actor     Bosco   3
4                 Stop Pepper Palmer  2014  Too $hort  actor   Himself NaN

In [32]:
titles = pd.read_csv('data/titles.csv')
titles.head()

                     title  year
0           The Rising Son  1990
1        Ashes of Kukulcan  2016
2  The Thousand Plane Raid  1969
3         Crucea de piatra  1993
4                   The 86  2015

<div class="alert alert-success">
    <b>EXERCISE</b>: How many movies are listed in the titles dataframe?
</div>

In [33]:
len(titles)

215981

<div class="alert alert-success">
    <b>EXERCISE</b>: What are the earliest two films listed in the titles dataframe?
</div>

In [34]:
titles.sort('year').head(2)

                                                    title  year
165182                                         Miss Jerry  1894
85708   Reproduction of the Corbett and Fitzsimmons Fight  1897

<div class="alert alert-success">
    <b>EXERCISE</b>: How many movies have the title "Hamlet"?
</div>

In [35]:
len(titles[titles.title == 'Hamlet'])

19

<div class="alert alert-success">
    <b>EXERCISE</b>: List all of the "Treasure Island" movies from earliest to most recent.
</div>

In [36]:
titles[titles.title == 'Treasure Island'].sort('year')

                  title  year
191379  Treasure Island  1918
47769   Treasure Island  1920
192917  Treasure Island  1934
90175   Treasure Island  1950
104714  Treasure Island  1972
103646  Treasure Island  1973
190792  Treasure Island  1985
166675  Treasure Island  1999

<div class="alert alert-success">
    <b>EXERCISE</b>: How many movies were made from 1950 through 1959?
</div>

In [37]:
t = titles
len(t[(t.year >= 1950) & (t.year <= 1959)])

12120

In [38]:
len(t[t.year // 10 == 195])

12120

<div class="alert alert-success">
    <b>EXERCISE</b>: How many roles in the movie "Inception" are NOT ranked by an "n" value?
</div>

In [39]:
c = cast
c = c[c.title == 'Inception']
c = c[c.n.isnull()]
len(c)

22

<div class="alert alert-success">
    <b>EXERCISE</b>: But how many roles in the movie "Inception" did receive an "n" value?
</div>

In [40]:
c = cast
c = c[c.title == 'Inception']
c = c[c.n.notnull()]
len(c)

51

<div class="alert alert-success">
    <b>EXERCISE</b>: Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.
</div>

In [41]:
c = cast
c = c[c.title == 'North by Northwest']
c = c[c.n.notnull()]
c = c.sort('n')
c

,title,year,name,type,character,n
778278,North by Northwest,1959,Cary Grant,actor,Roger O. Thornhill,1
3104905,North by Northwest,1959,Eva Marie Saint,actress,Eve Kendall,2
1300582,North by Northwest,1959,James Mason,actor,Phillip Vandamm,3
2794420,North by Northwest,1959,Jessie Royce Landis,actress,Clara Thornhill,4
317310,North by Northwest,1959,Leo G. Carroll,actor,The Professor,5
2702399,North by Northwest,1959,Josephine Hutchinson,actress,Mrs. Townsend,6
1513974,North by Northwest,1959,Philip Ober,actor,Lester Townsend,7
1137555,North by Northwest,1959,Martin Landau,actor,Leonard,8
2181363,North by Northwest,1959,Adam Williams,actor,Valerian,9
1616877,North by Northwest,1959,Edward Platt,actor,Victor Larrabee,10
594433,North by Northwest,1959,Robert Ellenstein,actor,Licht,11
2046317,North by Northwest,1959,Les Tremayne,actor,Auctioneer,12
413825,North by Northwest,1959,Philip Coolidge,actor,Dr. Cross,13
1347170,North by Northwest,1959,Patrick McVey,actor,Sergeant Flamm,14
182129,North by Northwest,1959,Edward Binns,actor,Captain Junket,15
1235786,North by Northwest,1959,Ken Lynch,actor,Charley - Chicago Policeman,16

<div class="alert alert-success">
    <b>EXERCISE</b>: How many roles were credited in the silent 1921 version of Hamlet?
</div>

In [42]:
c = cast
c = c[(c.title == 'Hamlet') & (c.year == 1921)]
len(c)

9

<div class="alert alert-success">
    <b>EXERCISE</b>: List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.
</div>

In [43]:
c = cast
c = c[c.name == 'Cary Grant']
c = c[c.year // 10 == 194]
c = c[c.n == 2]
c = c.sort('year')
c

                   title  year        name   type    character  n
778275  My Favorite Wife  1940  Cary Grant  actor         Nick  2
778285    Penny Serenade  1941  Cary Grant  actor  Roger Adams  2